; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-2 - location
	p0-3 - location
	p2-1 - location
	p2-4 - location
	p3-2 - location
	p3-5 - location
	p4-1 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s2)
	(at driver3 s4)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s4)
	(at package2 s3)
	(at package3 s2)
	(at package4 s1)
	(at package5 s4)
	(at package6 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 74)
	(= (time-to-drive s0 s1) 74)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 91)
	(= (time-to-drive s2 s1) 91)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 84)
	(= (time-to-drive s5 s2) 84)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 66)
	(= (time-to-drive s1 s3) 66)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 58)
	(= (time-to-drive s2 s3) 58)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 32)
	(= (time-to-drive s4 s3) 32)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 54)
	(= (time-to-drive s5 s3) 54)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 95)
	(= (time-to-drive s1 s4) 95)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 52)
	(= (time-to-drive s2 s4) 52)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 83)
	(= (time-to-drive s0 s5) 83)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 38)
	(= (time-to-drive s4 s5) 38)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s2)
	(at truck1 s0)
	(at truck2 s0)
	(at truck3 s3)
	(at package1 s4)
	(at package2 s5)
	(at package3 s5)
	(at package4 s1)
	(at package5 s0)
	(at package6 s3)
	))

(:metric minimize (+ (* 1 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver1 s4 p4-1)
   deleted: (at driver1 s4)
   added: (at driver1 p4-1)
   goals met: 3 of 12
2. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 12
3. (walk driver1 p4-1 s1)
   deleted: (at driver1 p4-1)
   added: (at driver1 s1)
   goals met: 4 of 12
4. (walk driver2 s2 p0-2)
   deleted: (at driver2 s2)
   added: (at driver2 p0-2)
   goals met: 4 of 12
5. (walk driver2 p0-2 s0)
   deleted: (at driver2 p0-2)
   added: (at driver2 s0)
   goals met: 5 of 12
6. (load-truck package5 truck3 s4)
   deleted: (at package5 s4)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 12
7. (drive-truck truck3 s4 s3 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 0 to 352
   goals met: 6 of 12
8. (load-truck package2 truck3 s3)
   deleted: (at package2 s3)
   added: (in package2 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 6 of 12
9. (drive-truck truck3 s3 s2 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 352 to 1106
   goals met: 5 of 12
10. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 5 of 12
11. (load-truck package6 truck3 s2)
   deleted: (at package6 s2)
   added: (in package6 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 5 of 12
12. (drive-truck truck3 s2 s3 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 1106 to 2266
   goals met: 6 of 12
13. (unload-truck package6 truck3 s3)
   deleted: (in package6 truck3)
   added: (at package6 s3)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 7 of 12
14. (drive-truck truck3 s3 s5 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (fuel-used) from 2266 to 3130
   goals met: 6 of 12
15. (unload-truck package3 truck3 s5)
   deleted: (in package3 truck3)
   added: (at package3 s5)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 7 of 12
16. (drive-truck truck3 s5 s0 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (fuel-used) from 3130 to 4209
   goals met: 7 of 12
17. (unload-truck package5 truck3 s0)
   deleted: (in package5 truck3)
   added: (at package5 s0)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 8 of 12
18. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 8 of 12
19. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 12
20. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   goals met: 7 of 12
21. (drive-truck truck3 s0 s5 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 4209 to 5122
   goals met: 7 of 12
22. (drive-truck truck3 s5 s3 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (fuel-used) from 5122 to 5716
   goals met: 8 of 12
23. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 8 of 12
24. (walk driver2 s3 p0-3)
   deleted: (at driver2 s3)
   added: (at driver2 p0-3)
   goals met: 8 of 12
25. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 7 of 12
26. (unload-truck package2 truck3 s3)
   deleted: (in package2 truck3)
   added: (at package2 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 12
27. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 8 of 12
28. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 8 of 12
29. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   goals met: 9 of 12
30. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 12
31. (drive-truck truck3 s3 s5 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (fuel-used) from 5716 to 6256
   goals met: 8 of 12
32. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 7 of 12
33. (drive-truck truck3 s5 s0 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (fuel-used) from 6256 to 7086
   goals met: 7 of 12
34. (drive-truck truck2 s1 s3 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 7086 to 7746
   goals met: 7 of 12
35. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 7 of 12
36. (drive-truck truck2 s3 s5 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 7746 to 8340
   goals met: 7 of 12
37. (unload-truck package2 truck2 s5)
   deleted: (in package2 truck2)
   added: (at package2 s5)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 8 of 12
38. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 9 of 12
39. (drive-truck truck2 s5 s2 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (fuel-used) from 8340 to 9180
   goals met: 9 of 12
40. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 8 of 12
41. (drive-truck truck3 s0 s5 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 9180 to 10010
   goals met: 8 of 12
42. (drive-truck truck3 s5 s3 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (fuel-used) from 10010 to 10550
   goals met: 9 of 12
43. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 9 of 12
44. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 9 of 12
45. (walk driver2 s3 p0-3)
   deleted: (at driver2 s3)
   added: (at driver2 p0-3)
   goals met: 9 of 12
46. (walk driver1 s2 p2-1)
   deleted: (at driver1 s2)
   added: (at driver1 p2-1)
   goals met: 9 of 12
47. (walk driver1 p2-1 s1)
   deleted: (at driver1 p2-1)
   added: (at driver1 s1)
   goals met: 10 of 12
48. (walk driver2 p0-3 s0)
   deleted: (at driver2 p0-3)
   added: (at driver2 s0)
   goals met: 11 of 12
49. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 12
50. (drive-truck truck2 s2 s5 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 10550 to 11390
   goals met: 10 of 12
51. (drive-truck truck2 s5 s0 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (fuel-used) from 11390 to 12220
   goals met: 11 of 12
52. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 11 of 12
53. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   goals met: 11 of 12
54. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   goals met: 12 of 12
